{
    "version": 1,
    "speakers": 
[
{"id": "3", "img": "/images/speaker/chris--adamson/photo_adamson_chris.jpg", "name": "Chris Adamson", "twitter": "invalidname", "blog": "www.subfurther.com/blog", "bio": "Chris Adamson is the co-author of <a href=\"https://pragprog.com/book/adios4/ios-10-sdk-development\"><i>iPhone 10 SDK Development</i></a> (Pragmatic Programmers) and <a href=\"http://is.gd/UEDYe4\"><i>Learning Core Audio</i></a> (Addison-Wesley Professional). He's also an independent iOS and Mac developer, based in Grand Rapids, Michigan, where he also writes the Time.code() blog at <a href=\"http://www.subfurther.com/blog\">subfurther.com/blog</a> and hosts livestreams at <a href=\"http://www.invalidstream.com\">invalidstream.com</a> . Over the years, he has managed to own fourteen and a half Macs."},
{"id": "199", "img": "/images/Aijaz-Ansari.png", "name": "Aijaz Ansari", "twitter": "_aijaz_", "website": "aijazansari.com", "bio": "A hacker by nature, Aijaz enjoys making things. He’s the developer and designer behind the <a href=\"http://quranmemorizer.com\">Qur’an Memorizer</a> iOS app, and the maintainer of a nifty open-source job scheduler called <a href=\"http://www.taskforest.com\">TaskForest</a>. He currently works as an iOS developer at <a href=\"http://www.fastmodelsports.com\">FastModel</a>. He also <a href=\"https://euclidte.ch\">teaches iOS development</a> on the weekends to children and adults in his community. In his spare time (we’re not sure he has any) Aijaz like to dabble in photography, woodworking, origami, and making tangible things with his hands."},
{"id": "43", "img": "/images/speaker/mike-ash/mike_ash.jpg", "name": "Mike Ash", "twitter": "mikeash", "blog": "www.mikeash.com", "bio": "Mike Ash has been programming for Apple platforms for over two decades and for Mac OS X since the Public Beta. He is the author of the bi-weekly <a href=\"http://mikeash.com/pyblog\">Friday Q&A</a> blog series on deep technical topics related to Mac and iOS programming, as well as the compilation book <a href=\"http://www.mikeash.com/book.html\">The Complete Friday Q&A: Volume I</a>. In between abusing the Objective-C runtime, he flies his glider over the beautiful Shenandoah Valley. When not flying, he holds down a day job at Plausible Labs. Mike's blog can be found at <a href=\"http://mikeash.com/pyblog\">http://mikeash.com/pyblog</a>."},
{"id": "25", "img": "/images/speaker/jeff--biggus/headshot.jpg", "name": "Jeff  Biggus", "twitter": "hyperjeff", "blog": "blog.hyperjeff.net", "bio": "Jeff Biggus is the founder of <a href=\"http://www.hyperjeff.com/\">HyperJeff</a>, Inc., producing Unix, Mac, iPhone and iPad apps, and custom in-house software for companies, specializing in scientific software. He has been an independent programming consultant for more than 15 years. Jeff cut his teeth on programming back in the early 1980's on the Apple ][+. He started the <a href=\"http://www.hyperjeff.net/\">HyperJeff Network</a> back in 1994, a site serving the Mac OS X community since the early Rhapsody days."},
{"id": "127", "img": "/images/speaker/janie-clayton-hasz/janie-clayton-hasz.png", "name": "Janie Clayton", "twitter": "redqueencoder", "blog": "redqueencoder.com", "bio": "Janie Clayton is an iOS developer living in Madison, WI. Janie also leads the Swift Tutorial Team for <a href=\"http://www.raywenderlich.com\">RayWenderlich.com</a>. She gave up her previous life to pursue programming in 2012 and so far has not regretted this decision. She catalogues her journey on her blog, <a href=\"http://redqueencoder.com\">redqueencoder.com</a>. When she isn't coding Janie is spending some quality time making music, cuddling with her pugs, and contemplating the nature of existence."},
{"id": "71", "img": "/images/speaker/jack-cox/Jack Cox.jpg", "name": "Jack Cox", "twitter": "_jack_cox", "bio": "Jack Cox is a software developer, systems architect, and Managing Director at CapTech Consulting. where he is responsible for the firm’s mobile software practice. Jack’s love of software development and all things mobile has driven a career developing software for businesses of all sizes including large-scale transaction processing systems, embedded software, and smart-phone software. Jack co-authored the book ‘Professional iOS Network Programming’ (Wiley). He has been involved in several startups, holds multiple patents and frequently presents to professional groups. He has a degree in computer science from Taylor University in Upland, Indiana. Jack lives in Richmond, Virginia with his wife and children."},
{"id": "60", "img": "/images/speaker/james-dempsey/James Dempsey.JPG", "name": "James Dempsey", "twitter": "jamesdempsey", "blog": "jamesdempsey.net", "bio": "James Dempsey is a fifteen-year Apple veteran gone indie. At Apple, he was an evangelist, technical trainer, curriculum manager, and software engineer, working on Aperture, iOS, and OS X releases Leopard through Lion. James is currently on the technical staff at <a href=\"https://upthere.com\">Upthere</a>, working to build a cloud computer for humankind’s information. He is also the frontman of James Dempsey and the Breakpoints, a band that performs humorous original songs about technical topics. Their debut album <a href=\"http://jamesdempsey.org/backtrace/\">Backtrace</a> topped the iTunes comedy charts in the US, UK, and Canada, reaching #5 on the Billboard comedy album chart."},
{"id": "194", "img": "/images/Jono-Guthrie.png", "name": "Jonathan Guthrie", "twitter": "iamjono", "bio": "Jono has been developing server side applications for nearly 20 years, with a number of different languages. Moved to Canada from New Zealand in 2010 to help architect the next generation of server side development, he’s now part of the Perfect team bringing Swift to the server. In his spare time he’s a session musician, sound engineer, gamer, and loves writing API’s for all sorts of obscure things."},
{"id": "198", "img": "/images/tom-harrington.png", "name": "Tom Harrington", "twitter": "atomicbird", "website": "www.atomicbird.com", "bio": "Tom is a veteran Mac and iOS developer at <a href=\"https://bombbomb.com\">BombBomb</a> in Colorado Springs, Colorado. He is co-author of “<i><a href=\"http://www.informit.com/store/core-data-for-ios-developing-data-driven-applications-9780321670427?ranMID=24808\">Core Data for iOS</a></i>” and “<i><a href=\"http://www.informit.com/store/learning-ipad-programming-a-hands-on-guide-to-building-9780133138719?ranMID=24808\">Learning iPad Programming</a></i>\", and has organized <a href=\"http://iosdevcampcolorado.com/post/142243853733/iosdevcamp-colorado-springs-2016\">iOSDevCamp Colorado Springs</a> for the past seven years. When not working, Tom is a radio DJ at KRCC in Colorado Springs, and relaxes by playing didgeridoo."},
{"id": "164", "img": "/images/speaker/kevin-jones/kevin-jones.png", "name": "Kevin Jones", "twitter": "kevinrj", "bio": "Kevin Jones has lived all of his life in the Madison Wisconsin area, (Mazomanie) except for 11 months during high school in Brazil as an exchange student. After getting a computer science degree from Edgewood college, Kevin worked 11 years at Cuna Mutual Group, where among other things he helped squash the Y2K bug. His first computer was an Apple IIe back in 11th grade, and after 16 years in the Microsoft world he returned to the Mac in 2010, where he feels accessibility for blind users like himself have more future potential. Kevin is currently spending a great deal of his time working to further that by helping fellow blind users learn, and also exploring improved efficiency through workflow automation."},
{"id": "70", "img": "/images/speaker/rob-napier/Rob Napier.png", "name": "Rob Napier", "twitter": "cocoaphony", "blog": "robnapier.net/blog/", "bio": "Rob is co-author of <a href=\"http://iosptl.com\">iOS Programming Pushing the Limits</a>. Before coming to Cocoa, he made his living sneaking into Chinese facilities in broad daylight. Later he became a Mac developer for Dell. It's not clear which was the stranger choice. He has a passion for the fiddly bits below the surface, like networking, performance, security, and text layout. He asks \"but is it good Swift?\" a lot."},
{"id": "131", "img": "/images/Jon-Reid-Updated.png", "name": "Jon Reid", "twitter": "qcoding", "blog": "qualitycoding.org", "bio": "Jon Reid is committed to helping iOS developers create Clean Code. He has practiced Test Driven Development since 2001, and is the author of OCHamcrest and OCMockito. Check out Jon’s blog  <a href=\"http://qualitycoding.org/start-here/\">Quality Coding</a>."},
{"id": "181", "img": "/images/Jeff-Roberts.png", "name": "Jeff Roberts", "twitter": "JeffBNimble", "bio": "Jeff Roberts began programming way back in the 80’s, the 1980’s that is, back when the music was great and the hair was big. He began his career in 1986 writing RPGII on an IBM System/36. In 1991, he ventured out as an independent software consultant, quickly transitioning to Object-Oriented Programming in Smalltalk, then to Java in 1996, then to Web Dev in 2002, then to Adobe Flex/AIR in 2007 and now doing mobile development in Android and iOS. If you’re counting, he’s been writing code in 4 different decades spanning nearly 30 years.<br><br>Jeff’s biggest claim to fame was as the lead developer of the original League of Legends client for Riot Games where he still consults and does mobile development. One of his proudest accomplishments is passing his passion for software development down to his son Kyle, who now also does mobile software development professionally. Plus, his wife is a visual/UX designer. What more can a nerd want?<br><br>You can find him and his son Kyle on their <a href=\"https://www.youtube.com/channel/UCUMAujrLQP-zB925se5YIiQ\">NimbleNoggin.io YouTube channel</a> where they publish lots of bite-sized videos on mobile development, on Twitter <a href=\"https://twitter.com/JeffBNimble\">@JeffBNimble</a> and GitHub at <a href=\"https://github.com/JeffBNimble\">JeffBNimble</a>."},
{"id": "130", "img": "/images/speaker/laura-savino/laura-savino.jpg", "name": "Laura Savino", "twitter": "savinola", "bio": "Laura is an iOS developer with a penchant for languages, travel, and education. She most recently worked to transform students' academic experience by building iOS apps at <a href=\"http://khanacademy.org\">Khan Academy</a>, and is now a highly sought-after freelance learner."},
{"id": "141", "img": "/images/speaker/ellen-shapiro/Ellen Shapiro.jpeg", "name": "Ellen Shapiro", "twitter": "designatednerd", "bio": "Ellen Shapiro is the Lead Mobile Developer for <a href=\"https://spothero.com\">SpotHero</a> and former Director of iOS Engineering at an <a href=\"http://vokalinteractive.com\">Vokal</a> in Chicago, IL. She also builds Android apps and runs the Chicago <a href=\"http://www.meetup.com/AndroidListener-Chicago/\">AndroidListener</a> meetup. She works in her spare time to bring leading songwriting application <a href=\"http://justhum.com\">Hum</a> to life, and writes iOS tutorials for <a href=\"http://www.raywenderlich.com\">RayWenderlich.com</a>."},
{"id": "14", "img": "/images/speaker/josh--smith/Josh_Smith.JPG", "name": "Josh Smith", "twitter": "kognate", "bio": "Josh has 20 years of professional IT experience and has been a sysadmin (and still kinda is), programmer in various languages, consultant, employee and guy who makes sure the pop machine is full. He lives, works, and occasionally builds robots in Pittsburgh, PA"},
{"id": "1", "img": "/images/speaker/daniel-steinberg/Daniel-Steinberg.jpg", "name": "Daniel Steinberg", "twitter": "dimsumthinking", "blog": "dimsumthinking.com", "bio": "Daniel is the author of the best selling books <a href=\"http://editorscut.com/Book/SwiftKickstart/bookPage.html\">A Swift Kickstart</a> and <a href=\"http://editorscut.com/Book/DevelopingIOS7Apps/bookPage.html\">Developing iOS 7 Apps for iPad and iPhone</a> (the official companion book to the popular iTunes U series from Stanford University).<br><br>He has written apps for the iPhone and the iPad since the SDKs first appeared and has written programs for the Mac all the way back to System 7.<br><br>Daniel presents iPhone, Cocoa, and Swift training and consults through his company <a href=\"http://www.dimsumthinking.com\">Dim Sum Thinking</a>. He is the co-host of the <a href=\"http://www.tinychallenges.com/show\">Tiny Challenges Podcast</a>. When he's not coding or talking about coding for the Mac, the iPhone, and the iPad he's probably cooking or hanging out with his daughter.<br><br>Information on his <a href=\"http://EditorsCut.com/Books/index.html\">books</a> is available on the <a href=\"http://EditorsCut.com\">Editors Cut</a> website. Details on his <a href=\"http://dimsumthinking.com/Services/Training/index.html\">training</a>, and <a href=\"http://dimsumthinking.com/Services/Speaking/index.html\">speaking</a> is on the <a href=\"http://dimsumthinking.com\">Dim Sum Thinking</a> website. "},
{"id": "45", "img": "/images/speaker/walter-tyree/Walter Tyree.JPG", "name": "Walter Tyree", "twitter": "walterpt", "blog": "www.tyreeapps.com", "bio": "A recovering IT Director, Walter heard the Siren's song of freelance work in 2010 and has been the owner and sole, human employee of <a href=\"http://www.tyreeapps.com\">Tyree Apps, LLC</a> ever since. In addition to mobile development, Tyree Apps offers training and management consulting. Though the most lucrative projects are development for other companies, Tyree Apps creates a handful of iOS apps under their own name. When he isn't working or attending IT conferences Walter likes to play with his dog, keep his 1973 Beetle running and ensure that his children will have interesting stories to tell their therapists in adulthood."},
{"id": "87", "img": "/images/speaker/t.j.-usiyan/tj_usiyan.png", "name": "T.J. Usiyan", "twitter": "griotspeak", "bio": "A writer, musician, and developer interested in crafting interesting and artful things. Developer of the iOS app <a href=\"https://itunes.apple.com/us/app/chordal-text/id1073371136?mt=8\">Chordal Text</a>, and AU Additive Synthesizer <a href=\"https://vimeo.com/55624701\">Partial</a>. TJ is working to create innovative and intuitive solutions to musical problems. He is a graduate of Eugene Lang College and Berklee College of Music."},
{"id": "183", "img": "/images/Jacob-Van-Order.png", "name": "Jacob Van Order", "twitter": "jacobvo", "website": "www.sushigrass.com", "bio": "Jacob Van Order is the Lead iOS Developer at <a href=\"http://www.grainger.com\">Grainger</a> and owns his own side company named <a href=\"http://www.sushigrass.com\">SushiGrass</a>. With a background in graphic design, he made the transition to iOS development around the time that iPhoneOS 2.0 came out. Since then, he's released numerous personal and professional apps for the iPhone, iPad, and Apple Watch. He cohosts the NSCoder Chicago meetup that meets the second tuesday of every month in Downtown Chicago."},
{"id": "114", "img": "/images/speaker/james-dempsey--and-the-breakpoints/breakpoint.jpg", "name": "James Dempsey  and the Breakpoints", "twitter": "jamesdempsey", "blog": "jamesdempsey.net", "bio": "James Dempsey and the Breakpoints."}
]
, "sessions": [
  { "id": "1",  "start": "201704200830", "end": "201704200900", "title": "Workshop Registration"}
, { "id": "2",  "start": "201704200900", "end": "201704201015", "speakerId": "1",  "title": "Thinking in Swift", "desc": "This fast-paced workshop shows you how to take advantage of Swift features to write more robust code that is easier to reason about. We'll spend a good part of the day looking at functional programming and playing with map, filter, reduce, and flatmap but we will also create instances of classes, structs, and enums. We'll explore how your iOS app architecture may change when you embrace idiomatic Swift.\n\nOne of the strengths of Swift is that it can borrow the best from a multitude of paradigms. We'll look at how to successfully weave together OO and functional code into a readable and flexible architecture and focus on protocol oriented programming.\n\nWe assume that you are an experienced programmer who has spent some time looking at Swift but you aren't yet an expert in Swift. You understand most of the hows and whats of working with Swift and are looking for the whys and wheres."}
, { "id": "3",  "start": "201704200900", "end": "201704201015", "speakerId": "45", "title": "NCIS: Elk Grove!", "desc": "This all day workshop will focus on strategies for debugging and the tools we have to find and exterminate the oddest of bugs in existing code. After reviewing our tools and some methodology for debugging; we will practice on contrived and real-world examples. We will tackle easy but common items first and then move on to harder examples involving memory pressure; wonky networks and race conditions. Then we’ll move on to truly bizarre problems that couldn’t ever happen in real life, could they? Attendees are encouraged to bring interesting bugs from their own work for the class to study."}
, { "id": "4",  "start": "201704200900", "end": "201704201015", "speakerId": "131",  "title": "Test-Driven Development Hands-On Workshop", "desc": "Like riding a bicycle, TDD is something you learn by doing. In this hands-on workshop, we’ll start out with a simple exercise to learn the basics of the TDD Waltz. Then we’ll make things more complex, work with a view controller, and finally discuss ways to tackle legacy code. Bring your laptop!"}
, { "id": "5",  "start": "201704201015", "end": "201704201030", "title": "Break"}
, { "id": "6",  "start": "201704201030", "end": "201704201200", "title": "Workshops Resume"}
, { "id": "7",  "start": "201704201200", "end": "201704201300", "title": "Lunch"}
, { "id": "8",  "start": "201704201300", "end": "201704201515", "title": "Workshops Resume"}
, { "id": "9",  "start": "201704201515", "end": "201704201530", "title": "Break"}
, { "id": "10", "start": "201704201530", "end": "201704201730", "title": "Workshops Resume"}
, { "id": "11", "start": "201704201730", "end": "201704201731", "title": "Workshops Conclude - Evening On Your Own"}
, { "id": "12", "start": "201704210800", "end": "201704210900", "title": "Registration, Breakfast, and Opening Remarks"}
, { "id": "13", "start": "201704210900", "end": "201704211000", "speakerId": "70", "title": "Keynote"}
, { "id": "14", "start": "201704211000", "end": "201704211015", "title": "Break"}
, { "id": "15", "start": "201704211015", "end": "201704211115", "speakerId": "183", "title": "Building Web Applications with Kitura", "desc": "Headed up by IBM, Kitura is an open-source, scalable web framework that uses Swift in order to create web services on Mac or Linux. If you're an iOS Developer who is interested in backend web development but don't have the time to learn another language, Kitura offers the chance for you to set up your own API for your app while sharing model objects between the server and the client. We'll be going over basics, setup, and common use cases for this fast-growing framework." }
, { "id": "16", "start": "201704211015", "end": "201704211115", "speakerId": "71", "title": "Image Recognition APIs Cage Match", "desc": "Leveraging the power of machine learning, image recognition APIs have become a powerful resource for system developers. There are a number of product offerings from IBM, Google, Amazon, Microsoft, and others. This talk compares and contrasts the APIs, performance, and most importantly, the accuracy of leading image recognition APIs. The APIs are not created equal and they don't perform equally. Some of the vendors excel at specific problems and struggle with others. This talk leverages several months of research and testing we performed to help you figure out which vendors may be best suited for your problem space." }
, { "id": "17", "start": "201704211015", "end": "201704211115", "speakerId": "3", "title": "Media Frameworks and Swift: This Is Fine", "desc": "Swift is great for writing iOS and Mac apps, and its creators also mean for it to be used as a systems programming language. However, certain traits about Swift make it officially off-limits for use in some audio/video-processing scenarios. What's the deal, is it not fast enough or what? We'll look at what media apps can and can't do in Swift, and what you're supposed to do instead. We'll also look at strategies for knowing what responsibilities to dole out to Swift and to C, and how to make those parts of your code play nicely with each other." }
, { "id": "18", "start": "201704211115", "end": "201704211130", "title": "Break"}
, { "id": "19", "start": "201704211130", "end": "201704211230", "speakerId": "14", "title": "Microservices in Swift", "desc": "Micro services architecture is an approach to software development where a single application is composed of many small services, each running in its own process space and communicating via lightweight methods. Micro services used to be really hard to deploy but that’s not true anymore. Now we can even write them in Swift.\n\nIn this talk we’ll cover how micro services can help you as a developer and how to make them in swift. We’ll even talk about two ways to deploy them (one using a serverless system called OpenWhisk from Apache and the other using Docker swarms)."}
, { "id": "20", "start": "201704211130", "end": "201704211230", "speakerId": "127", "title": "Buffers and Encoders and Command Queues, Oh My!", "desc": "Many people, including myself, were really excited when Metal was announced in 2014. We thought about all the neat graphics programming we would be able to do. Then we watched the WWDC videos and ran into a wall of jargon. What the heck is a command encoder? What does that have to do with graphics programming??\n\nIn this session we will demystify some of these concepts and show how they contribute to the images you see on the screen. If you've had some trouble getting off the ground with Metal this will give you a nudge in the right direction."}
, { "id": "21", "start": "201704211130", "end": "201704211230", "speakerId": "181", "title": "Remove the \"M\" from MVC", "desc": "Unless you've lived under a rock, you're familiar with the MVC architecture. It's been around since the 1970's. However, I would like to propose that the \"M\" as we know it isn't really necessary anymore. If you come to this session, I'll expect you have a basic understanding of MVC and then I'll propose to you we don't need the \"M\" anymore. Intrigued? Come hear me out. Dump the M. You don't need it."}
, { "id": "22", "start": "201704211230", "end": "201704211315", "title": "Lunch"}
, { "id": "23", "start": "201704211315", "end": "201704211400", "title": "Lighting Talks"}
, { "id": "24", "start": "201704211400", "end": "201704211415", "title": "Break"}
, { "id": "25", "start": "201704211415", "end": "201704211515", "speakerId": "164", "title": "Seeing Interfaces with VoiceOver", "desc": "People talk about accessibility, and if is an app accessible or not. While any attempt to make an app more accessible is appreciated, “totally accessible” doesn’t mean that it’s efficient.\n\nIn this talk, Kevin will show you how VoiceOver thinks, how it behaves, and explore the differences between accessibility and efficiency, and arrive at how it’s all really a spectrum that we all live on.\n\n\"There are those with disabilities and there are those who haven’t quite found their’s yet.\" --Chris Downey"}
, { "id": "26", "start": "201704211415", "end": "201704211515", "speakerId": "199", "title": "Beyond Breakpoints - Advanced Debugging with XCode", "desc": "The less time we spend debugging, the better. XCode offers much more than just a strategically placed call to NSLog. This talk will introduce you to some powerful but lesser-known debugging strategies and tricks. We will begin by exploring the advanced features of breakpoints, and how to use the strengths of the Clang expression parser to inject code into an app being debugged. Next, you will learn how to use XCode's new visual memory debugger to hunt down leaks. Finally, you will see how to extend LLDB to debug views and run external commands on JSON fetched from web services."}
, { "id": "27", "start": "201704211415", "end": "201704211515", "speakerId": "43", "title": "Unicode and Swift Strings", "desc": "Text and string processing is a subject that looks easy at first, but becomes tremendously complicated the more you look into it. Unicode is the modern standard for computer text processing, and it's full of complexity. In this talk, we'll take a deep look at Unicode's history, design, and structure. You'll learn about code points, code units, combining characters, normalization, emoji, UTF-8, UTF-16, and UTF-32. With this foundation in place, we'll bring it all back to practical applications by seeing how it fits in with Swift's powerful but sometimes complicated String API."}
, { "id": "28", "start": "201704211515", "end": "201704211530", "title": "Break"}
, { "id": "29", "start": "201704211530", "end": "201704211630", "speakerId": "164", "title": "Helping VoiceOver See More Clearly", "desc": "Apple’s interface builder gives you considerable accessibility for free, but developers, being creators, often will want something new.\n\nIn this talk, we’ll see how you can take advantage of accessibility in default UI controls when available, and approaches developers can take when making User Interfaces from scratch. We’ll talk about how to test for accessibility (beyond the simulator), and hopefully someone might be brave and let us test their app."}
, { "id": "30", "start": "201704211530", "end": "201704211630", "speakerId": "70", "title": "Learning From Our Elders: Applying functional insights without losing Swift", "desc": "Swift is not a functional programming language. Pushing too hard to make it one fights Swift and breaks Cocoa.\n\nBut Swift has absorbed some fantastic lessons from the functional world, and while value types may not quite be the present, they are clearly the future. We’ll explore how decades of work in functional languages have influenced Swift, and how you can use those features best while staying true to Swift."}
, { "id": "31", "start": "201704211530", "end": "201704211630", "speakerId": "198", "title": "Mastering Stack Views", "desc": "Autolayout is nice, but can still be tedious and error prone. Stack views can come to the rescue, making most of your constraints unnecessary. At the same time they can make your user interface more dynamic, easily handing changes in device size, orientation, and even changing design requirements. In this session you’ll learn how to make the most of UIStackView in your apps."}
, { "id": "32", "start": "201704211630", "end": "201704211645", "title": "Break"}
, { "id": "33", "start": "201704211645", "end": "201704211745", "speakerId": "131", "title": "Model View Presenter and the Power of Refactoring", "desc": "Untamed MVC leads to “massive view controller”. While MVVM is a popular alternative among iOS developers, Jon will show his favorite approach: Model View Presenter. In particular, Jon will show how you can refactor your way there."}
, { "id": "34", "start": "201704211645", "end": "201704211745", "speakerId": "45", "title": "I Know it When I See It", "desc": "Animation timings and gameplay actions are controlled by numerical values. However, discovering those values is much harder than measuring the pixel sizes of static images from a designer. This talk provides ideas and strategies for how you can make working models in Xcode and which values are the most important when you are trying to decide how to delight your users with your animations and gameplay."}
, { "id": "35", "start": "201704211645", "end": "201704211745", "speakerId": "25", "title": "Hijack your GPU! - Compute kernels with Metal + Swift", "desc": "Let's explore directly programming the GPU using Metal and Swift. Enjoy giant speed gains in your existing code, and dream up whole new classes of apps.\n\nIt's not obvious how to even start thinking about this stuff. What kinds of problems can be attacked? What is the learning curve? What are the trade offs? We'll get things cleared up and start exploring with real code.\n\nSwift-Metal playgrounds will be available to get your feet wet and start experimenting. You'll go home with a starting point for your own projects."}
, { "id": "36", "start": "201704211745", "end": "201704211900", "title": "Break"}
, { "id": "37", "start": "201704211900", "end": "201704212000", "speakerId": "1", "title": "KLOC", "desc": "We’ll use the dying world of FM radio to understand how to schedule and spend our time."}
, { "id": "38", "start": "201704222000", "end": "201704212100", "speakerId": "1", "title": "Breakpoint Jam", "desc": "A live performance by James Dempsey and the Breakpoints."}
, { "id": "39", "start": "201704220800", "end": "201704220900", "title": "Breakfast"}
, { "id": "40", "start": "201704220900", "end": "201704221000", "speakerId": "45", "title": "Keynote"}
, { "id": "41", "start": "201704221000", "end": "201704221015", "title": "Break"}
, { "id": "42", "start": "201704221015", "end": "201704221115", "speakerId": "14", "title": "Using Torch7 and Neural Networks on iOS", "desc": "Torch7 provides a Matlab-like environment for state-of-the-art machine learning algorithms. It is easy to use and provides a very efficient implementation, thanks to an easy and fast scripting language (Lua) and a underlying C implementation.\n\nIn this moderately advanced tutorial I’ll be covering how to use Torch7 on iOS to construct simple neural networks and do some cool stuff."}
, { "id": "43", "start": "201704221015", "end": "201704221115", "speakerId": "70", "title": "Practical Security", "desc": "Keychain, disk encryption, Common Crypto, certificates. Security can be daunting for Cocoa developers. There are so many frameworks filled with words you’ve never heard before solving problems you don’t understand. And why does so much of it have to be in C?\n\nThe truth is that good security is hard, but the code doesn’t have to be. This session will show you how to best use the many security tools Apple provides. You’ll learn how to properly encrypt with AES, how to make the most of iOS’s device encryption features, how to best manage SSL, and more. If you’re using AES for anything, but don’t know what an HMAC is, you need to attend this session."}
, { "id": "44", "start": "201704221015", "end": "201704221115", "speakerId": "3", "title": "Firebase: Totally Not Parse All Over Again (Unless It Is)", "desc": "With Facebook shutting down Parse, everybody knows to never again depend on a third party for their backend solution, right? Sure, and after you spend six months trying to write your own syncing service, how's that working? In 2016, Google has added a ton of features to Firebase, their popular backend-as-a-service solution. Firebase's primary offering is a realtime database in the cloud that syncs changes to and from multiple concurrent users, and their Swift-friendly iOS SDK makes it ideal for mobile use. In this session, you'll learn how to set up a Firebase backend and build an iOS app around it."}
, { "id": "45", "start": "201704221115", "end": "201704221130", "title": "Break"}
, { "id": "46", "start": "201704221130", "end": "201704221230", "speakerId": "87", "title": "TBA", "desc": "TBA"}
, { "id": "47", "start": "201704221130", "end": "201704221230", "speakerId": "141", "title": "Pushing the Envelope with iOS 10 Notifications", "desc": "Apple made major changes to the Notification APIs in iOS 10, affecting both Push and Local notifications. In this session, you'll get a high-level overview on what's changed, what you need to do to make sure your existing apps keep working, a few pitfalls to avoid during the transition, and some examples of the cool stuff you can do with the new toys."}
, { "id": "48", "start": "201704221130", "end": "201704221230", "speakerId": "43", "title": "Exploring Swift Memory Layout", "desc": "Let's get down to bits and bytes! Abstraction is great, but sometimes it's useful to dig down. In this session, we'll explore exactly how Swift lays out data in memory, including both your own variables and Swift's internal data structures. We'll build a program to recursively scan memory at runtime to dump out everything we want to know, then walk through its results and what they mean, and compare and contrast with how C and C++ store their data."}
, { "id": "49", "start": "201704221230", "end": "201704221315", "title": "Lunch"}
, { "id": "50", "start": "201704221315", "end": "201704221400", "speakerId": "130", "title": "Clear as a Bell: Sharing Technical Expertise"}
, { "id": "51", "start": "201704221400", "end": "201704221415", "title": "Break"}
, { "id": "52", "start": "201704221415", "end": "201704221515", "speakerId": "194", "title": "TBA", "desc": "TBA"}
, { "id": "53", "start": "201704221415", "end": "201704221515", "title": "TBA", "desc": "TBA"}
, { "id": "54", "start": "201704221415", "end": "201704221515", "speakerId": "60", "title": "TBA", "desc": "TBA"}

    ]
}
